In [12]:
## 데이터 프레임의 결합
#단순한 행,열 결합

In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-1.5.3-cp311-cp311-win_amd64.whl (10.3 MB)
     ---------------------------------------- 10.3/10.3 MB 6.6 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\kyu11\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2022.7.1-py2.py3-none-any.whl (499 kB)
     -------------------------------------- 499.4/499.4 kB 6.3 MB/s eta 0:00:00
Collecting numpy>=1.21.0
  Downloading numpy-1.24.2-cp311-cp311-win_amd64.whl (14.8 MB)
     ---------------------------------------- 14.8/14.8 MB 6.4 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\kyu11\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.24.2 pandas-1.5.3 pytz-2022.7.1

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
#데이터 프레임의 결합
#1. 단순행, 열결합

In [5]:
df = pd.DataFrame({
    'S1' : [1,2,3,4],
    'S2' : [5,6,7,8]
})
df

   S1  S2
0   1   5
1   2   6
2   3   7
3   4   8

In [6]:
df2 = pd.DataFrame([1,2])
df2

   0
0  1
1  2

In [7]:
###concat()

#1. 데이터프레임을 결합하는 함수
#2, 매개변수 axis -> 행을 추가할지 열을 추가할지 지정
#3. 단순하게 데이터 프레임을 결함
#4. 매개변수 ignore_index -> 기본값은 flase, 인덱스의 값을 그대로 유지할지 지정

In [8]:
## 단순하게 행을 추가, 인덱스를 재지정
# case1
#pd.concat([df, df2]), axis = 0.reset_index(drop=True)

# case 2
pd.concat([df, df2], axis = 0, ignore_index = True)

    S1   S2    0
0  1.0  5.0  NaN
1  2.0  6.0  NaN
2  3.0  7.0  NaN
3  4.0  8.0  NaN
4  NaN  NaN  1.0
5  NaN  NaN  2.0

In [10]:
#열을 추가
pd.concat([df, df2], axis = 1 )

   S1  S2    0
0   1   5  1.0
1   2   6  2.0
2   3   7  NaN
3   4   8  NaN

In [11]:
df3 = pd.DataFrame({
    'S1' : [1,2]
})
df3

   S1
0   1
1   2

In [12]:
pd.concat([df, df3], axis = 0)

   S1   S2
0   1  5.0
1   2  6.0
2   3  7.0
3   4  8.0
0   1  NaN
1   2  NaN

In [13]:
#merge()
#1. 데이터프레임을 결합하는 함수
#2. 특정조건에 맞춰서 열을 추가
#3. 매개변수 on -> 조건
#4. 매개변수 how -> 데이터프레임의 기준점 (left, right,inner:교집합,outer:합집합)

In [14]:
data = [
    ['전기전자', '005930', '삼성전자', 74400],
    ['화학', '051910', 'LG화학', 896000],
    ['전기전자', '000660', 'SK하이닉스', 101500]
]
colums = ['업종', '종목코드','종목명', '현재가']
df = pd.DataFrame(data=data, columns=colums)
df

     업종    종목코드     종목명     현재가
0  전기전자  005930    삼성전자   74400
1    화학  051910    LG화학  896000
2  전기전자  000660  SK하이닉스  101500

In [15]:
data = [
    ['은행', 2.92],
    ['보험', 0.37],
    ['화학', 0.06],
    ['전기전자', -2.43]
]
colums = ['업종', '등락률']
df2 = pd.DataFrame(data=data, columns=colums)
df2

     업종   등락률
0    은행  2.92
1    보험  0.37
2    화학  0.06
3  전기전자 -2.43

In [16]:
pd.merge(left = df, right = df2, on ='업종', how ='right')

     업종    종목코드     종목명       현재가   등락률
0    은행     NaN     NaN       NaN  2.92
1    보험     NaN     NaN       NaN  0.37
2    화학  051910    LG화학  896000.0  0.06
3  전기전자  005930    삼성전자   74400.0 -2.43
4  전기전자  000660  SK하이닉스  101500.0 -2.43

In [17]:
df3 = pd.DataFrame({
    '업종': ['서비스업'],
    '종목코드': ['035720'],
    '종목명': ['카카오'],
    '현재가': [121500]
    })
df3

     업종    종목코드  종목명     현재가
0  서비스업  035720  카카오  121500

In [18]:
df4 = pd.concat([df, df3], axis=0, ignore_index=True) #ignore_index=True; index의 01234,01234를 막고 1234로만 실행
df4

     업종    종목코드     종목명     현재가
0  전기전자  005930    삼성전자   74400
1    화학  051910    LG화학  896000
2  전기전자  000660  SK하이닉스  101500
3  서비스업  035720     카카오  121500

In [19]:
pd.merge(df4, df2, on='업종', how='outer')

     업종    종목코드     종목명       현재가   등락률
0  전기전자  005930    삼성전자   74400.0 -2.43
1  전기전자  000660  SK하이닉스  101500.0 -2.43
2    화학  051910    LG화학  896000.0  0.06
3  서비스업  035720     카카오  121500.0   NaN
4    은행     NaN     NaN       NaN  2.92
5    보험     NaN     NaN       NaN  0.37